const Discord = require("discord.js");

exports.run = (client, message, args) => {
  // Komutun yazıldığı mesajı sil
  message.delete().catch(err => console.error("Mesaj silinemedi:", err));
  const kurallar2 = `\`\`\`fix
|─────────────────────────────────────────────────────────────────────────────|
1 - ᴋᴜʀᴀʟʟᴀʀᴀ ᴜʏᴍᴀʏᴀɴ ᴀᴛıʟıʀ
2 - ʀᴇᴋᴏᴅᴀ [ᴄᴛʀʟ] ʏᴀsᴀᴋᴛıʀ
3 - ʙɪᴢ ʙɪʀ ᴀɪʟᴇ ʏɪᴢ
4 - sᴀʏɢıʟı sᴇᴠɢɪʟɪ ᴏʀᴛᴀᴍ
|─────────────────────────────────────────────────────────────────────────────|
5 - ᴋüғüʀ ᴇᴅᴇɴʟᴇʀᴇ [𝟻] ᴅᴀᴋɪᴋᴀ [ᴍᴜᴛᴇ]
6 - ᴀɴᴀ ᴋüғüʀ [10] ᴅᴀᴋɪᴋᴀ [ᴍᴜᴛᴇ]
7 - ᴋıᴢʟᴀʀᴀ ᴋüғüʀ [3] ᴅᴀᴋɪᴋᴀ [ᴍᴜᴛᴇ]
8 - ʏᴇᴛᴋɪʟɪ'ʟᴇʀᴇ ᴋüғüʀ [20] ᴅᴀᴋɪᴋᴀ [ᴍᴜᴛᴇ]
9 - sɪʏᴀsᴇᴛ ᴋᴏɴᴜşᴍᴀ [8] ᴅᴀᴋɪᴋᴀ [ᴍᴜᴛᴇ]
10 - ᴀşᴀğıʟᴀᴍᴀᴋ ғʟᴏᴏᴅ ʏᴀᴘᴍᴀᴋ ʀᴇᴋʟᴀᴍ ʏᴀᴘᴍᴀᴋ [ᴍᴜᴛᴇ]
11 - Öᴢᴇʟᴅᴇɴ ʀᴇᴋʟᴀᴍ ʟɪɴᴋ ʏᴀᴘᴍᴀᴋ [ʙᴀɴ]
12 - ᴛᴇʜᴅɪᴛ ᴇᴛᴍᴇᴋ [ʙᴀɴ]
13 - ᴋɪşɪsᴇʟ ʙɪʟɢɪʟᴇʀɪ İғşᴀ ᴇᴛᴍᴇᴋ ʏᴀsᴀᴋᴛıʀ. [BAN]'Sebebi
14 - ʜᴇʀ ʜᴀɴɢɪ ʙɪʀ sᴜɴᴜᴄᴜ İsᴍɪ ᴠᴇʀᴍᴇᴋ ʏᴀsᴀᴋᴛıʀ. [4] ᴅᴀᴋɪᴋᴀ [ᴍᴜᴛᴇ]
|─────────────────────────────────────────────────────────────────────────────|
\`\`\``;

  message.channel.send(kurallar2);
};

exports.conf = {
  enabled: true,
  guildOnly: false,
  aliases: ["kurallar2"],
  permLevel: 0
};

exports.help = {
  name: "rules2"
};
